; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=381, out_folder=htg/blocksworld/training, instance_id=87, seed=2111, goal_proportion=0.03

(define (problem blocksworld-87)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 - object)
 (:init 
    (arm-empty)
    (clear b88)
    (on b88 b212)
    (on-table b212)
    (clear b41)
    (on-table b41)
    (clear b305)
    (on-table b305)
    (clear b101)
    (on-table b101)
    (clear b302)
    (on b302 b89)
    (on b89 b320)
    (on b320 b269)
    (on b269 b316)
    (on-table b316)
    (clear b105)
    (on-table b105)
    (clear b365)
    (on b365 b381)
    (on b381 b158)
    (on b158 b83)
    (on b83 b67)
    (on-table b67)
    (clear b362)
    (on-table b362)
    (clear b79)
    (on b79 b242)
    (on b242 b202)
    (on b202 b356)
    (on-table b356)
    (clear b100)
    (on b100 b10)
    (on b10 b94)
    (on b94 b111)
    (on-table b111)
    (clear b322)
    (on b322 b185)
    (on b185 b311)
    (on b311 b208)
    (on b208 b199)
    (on b199 b167)
    (on b167 b203)
    (on b203 b142)
    (on-table b142)
    (clear b80)
    (on b80 b369)
    (on b369 b81)
    (on b81 b182)
    (on b182 b31)
    (on-table b31)
    (clear b232)
    (on b232 b264)
    (on-table b264)
    (clear b19)
    (on b19 b140)
    (on b140 b376)
    (on b376 b255)
    (on b255 b173)
    (on b173 b253)
    (on b253 b162)
    (on b162 b228)
    (on-table b228)
    (clear b32)
    (on b32 b252)
    (on b252 b147)
    (on b147 b61)
    (on b61 b220)
    (on b220 b65)
    (on b65 b278)
    (on b278 b107)
    (on b107 b103)
    (on-table b103)
    (clear b180)
    (on b180 b3)
    (on b3 b7)
    (on-table b7)
    (clear b138)
    (on b138 b327)
    (on b327 b367)
    (on b367 b348)
    (on b348 b209)
    (on b209 b21)
    (on-table b21)
    (clear b161)
    (on b161 b27)
    (on b27 b303)
    (on b303 b291)
    (on b291 b33)
    (on-table b33)
    (clear b75)
    (on b75 b300)
    (on b300 b23)
    (on b23 b207)
    (on-table b207)
    (clear b145)
    (on b145 b224)
    (on-table b224)
    (clear b336)
    (on b336 b193)
    (on b193 b86)
    (on b86 b374)
    (on b374 b268)
    (on b268 b74)
    (on b74 b256)
    (on b256 b310)
    (on b310 b127)
    (on b127 b292)
    (on b292 b298)
    (on-table b298)
    (clear b230)
    (on-table b230)
    (clear b236)
    (on b236 b281)
    (on-table b281)
    (clear b380)
    (on b380 b288)
    (on-table b288)
    (clear b37)
    (on-table b37)
    (clear b330)
    (on-table b330)
    (clear b373)
    (on b373 b186)
    (on b186 b229)
    (on-table b229)
    (clear b325)
    (on b325 b279)
    (on b279 b51)
    (on b51 b213)
    (on-table b213)
    (clear b9)
    (on b9 b247)
    (on b247 b184)
    (on b184 b98)
    (on b98 b319)
    (on-table b319)
    (clear b201)
    (on-table b201)
    (clear b11)
    (on b11 b215)
    (on b215 b133)
    (on b133 b20)
    (on b20 b59)
    (on b59 b69)
    (on b69 b134)
    (on-table b134)
    (clear b364)
    (on b364 b130)
    (on b130 b206)
    (on b206 b198)
    (on b198 b226)
    (on b226 b156)
    (on-table b156)
    (clear b153)
    (on b153 b273)
    (on-table b273)
    (clear b231)
    (on b231 b313)
    (on-table b313)
    (clear b285)
    (on b285 b90)
    (on-table b90)
    (clear b57)
    (on b57 b38)
    (on-table b38)
    (clear b194)
    (on b194 b35)
    (on b35 b277)
    (on b277 b216)
    (on b216 b368)
    (on b368 b181)
    (on b181 b312)
    (on-table b312)
    (clear b287)
    (on b287 b217)
    (on b217 b174)
    (on b174 b137)
    (on b137 b345)
    (on b345 b165)
    (on b165 b328)
    (on b328 b306)
    (on b306 b333)
    (on b333 b95)
    (on b95 b344)
    (on b344 b355)
    (on b355 b284)
    (on b284 b159)
    (on b159 b82)
    (on b82 b359)
    (on-table b359)
    (clear b120)
    (on b120 b261)
    (on b261 b2)
    (on b2 b149)
    (on-table b149)
    (clear b195)
    (on b195 b139)
    (on b139 b102)
    (on b102 b270)
    (on b270 b297)
    (on b297 b136)
    (on b136 b377)
    (on-table b377)
    (clear b36)
    (on b36 b370)
    (on b370 b119)
    (on b119 b358)
    (on b358 b241)
    (on b241 b343)
    (on b343 b73)
    (on b73 b157)
    (on-table b157)
    (clear b218)
    (on b218 b283)
    (on b283 b225)
    (on b225 b58)
    (on b58 b187)
    (on b187 b96)
    (on b96 b150)
    (on b150 b143)
    (on-table b143)
    (clear b357)
    (on-table b357)
    (clear b205)
    (on b205 b257)
    (on-table b257)
    (clear b160)
    (on b160 b271)
    (on b271 b323)
    (on b323 b337)
    (on b337 b299)
    (on b299 b286)
    (on b286 b54)
    (on b54 b324)
    (on-table b324)
    (clear b66)
    (on b66 b72)
    (on b72 b135)
    (on b135 b188)
    (on b188 b263)
    (on b263 b168)
    (on b168 b338)
    (on b338 b114)
    (on-table b114)
    (clear b171)
    (on-table b171)
    (clear b329)
    (on-table b329)
    (clear b115)
    (on-table b115)
    (clear b372)
    (on-table b372)
    (clear b321)
    (on b321 b77)
    (on b77 b260)
    (on-table b260)
    (clear b148)
    (on-table b148)
    (clear b42)
    (on-table b42)
    (clear b132)
    (on-table b132)
    (clear b1)
    (on b1 b254)
    (on b254 b44)
    (on b44 b28)
    (on b28 b8)
    (on b8 b56)
    (on b56 b155)
    (on b155 b17)
    (on-table b17)
    (clear b375)
    (on b375 b214)
    (on b214 b87)
    (on-table b87)
    (clear b191)
    (on b191 b166)
    (on b166 b227)
    (on-table b227)
    (clear b315)
    (on b315 b204)
    (on-table b204)
    (clear b331)
    (on-table b331)
    (clear b272)
    (on b272 b123)
    (on b123 b68)
    (on b68 b104)
    (on-table b104)
    (clear b85)
    (on b85 b97)
    (on b97 b25)
    (on b25 b29)
    (on b29 b62)
    (on b62 b30)
    (on b30 b301)
    (on-table b301)
    (clear b49)
    (on b49 b309)
    (on b309 b307)
    (on-table b307)
    (clear b50)
    (on b50 b266)
    (on b266 b128)
    (on-table b128)
    (clear b109)
    (on b109 b346)
    (on b346 b52)
    (on-table b52)
    (clear b84)
    (on b84 b48)
    (on-table b48)
    (clear b379)
    (on b379 b248)
    (on b248 b118)
    (on b118 b113)
    (on-table b113)
    (clear b43)
    (on b43 b112)
    (on b112 b267)
    (on b267 b308)
    (on-table b308)
    (clear b163)
    (on b163 b200)
    (on-table b200)
    (clear b116)
    (on b116 b151)
    (on b151 b340)
    (on b340 b262)
    (on b262 b183)
    (on b183 b197)
    (on b197 b237)
    (on b237 b45)
    (on b45 b40)
    (on-table b40)
    (clear b189)
    (on b189 b342)
    (on-table b342)
    (clear b13)
    (on b13 b350)
    (on b350 b78)
    (on-table b78)
    (clear b175)
    (on b175 b353)
    (on b353 b6)
    (on-table b6)
    (clear b196)
    (on-table b196)
    (clear b169)
    (on b169 b179)
    (on-table b179)
    (clear b108)
    (on b108 b5)
    (on b5 b289)
    (on-table b289)
    (clear b354)
    (on b354 b190)
    (on-table b190)
    (clear b314)
    (on b314 b99)
    (on b99 b249)
    (on b249 b63)
    (on b63 b295)
    (on b295 b53)
    (on b53 b351)
    (on b351 b172)
    (on-table b172)
    (clear b110)
    (on b110 b276)
    (on b276 b332)
    (on b332 b210)
    (on b210 b46)
    (on b46 b131)
    (on b131 b363)
    (on b363 b275)
    (on b275 b245)
    (on b245 b92)
    (on b92 b124)
    (on b124 b352)
    (on b352 b121)
    (on-table b121)
    (clear b125)
    (on b125 b152)
    (on b152 b259)
    (on b259 b164)
    (on b164 b296)
    (on b296 b211)
    (on-table b211)
    (clear b154)
    (on b154 b24)
    (on b24 b282)
    (on b282 b15)
    (on b15 b26)
    (on b26 b280)
    (on-table b280)
    (clear b176)
    (on-table b176)
    (clear b304)
    (on b304 b290)
    (on b290 b144)
    (on-table b144)
    (clear b223)
    (on b223 b64)
    (on b64 b93)
    (on-table b93)
    (clear b70)
    (on b70 b47)
    (on b47 b14)
    (on-table b14)
    (clear b146)
    (on b146 b76)
    (on b76 b18)
    (on b18 b250)
    (on b250 b378)
    (on b378 b360)
    (on b360 b349)
    (on-table b349)
    (clear b366)
    (on b366 b235)
    (on b235 b334)
    (on b334 b240)
    (on b240 b326)
    (on b326 b71)
    (on-table b71)
    (clear b34)
    (on b34 b221)
    (on b221 b265)
    (on b265 b246)
    (on b246 b141)
    (on-table b141)
    (clear b233)
    (on b233 b177)
    (on b177 b339)
    (on-table b339)
    (clear b244)
    (on b244 b341)
    (on b341 b361)
    (on b361 b129)
    (on b129 b55)
    (on b55 b258)
    (on b258 b219)
    (on b219 b318)
    (on-table b318)
    (clear b371)
    (on-table b371)
    (clear b222)
    (on b222 b22)
    (on b22 b243)
    (on b243 b126)
    (on b126 b106)
    (on b106 b91)
    (on b91 b39)
    (on-table b39)
    (clear b16)
    (on b16 b122)
    (on b122 b335)
    (on b335 b293)
    (on b293 b12)
    (on-table b12)
    (clear b274)
    (on-table b274)
    (clear b347)
    (on b347 b294)
    (on-table b294)
    (clear b170)
    (on b170 b4)
    (on b4 b239)
    (on b239 b117)
    (on b117 b238)
    (on b238 b60)
    (on b60 b317)
    (on b317 b234)
    (on b234 b192)
    (on b192 b251)
    (on b251 b178)
    (on-table b178))
 (:goal  (and 
    (clear b7)
    (on b7 b9)
    (on b9 b6)
    (on b6 b2)
    (on b2 b8)
    (on-table b8)
    (clear b5)
    (on-table b5)
    (clear b1)
    (on b1 b10)
    (on b10 b4)
    (on b4 b3)
    (on-table b3)
    (clear b11)
    (on-table b11))))

; plan
1. (unstack b11 b215)
   deleted: (on b11 b215) (clear b11) (arm-empty)
   added: (holding b11) (clear b215)
   goals met: 1 of 15
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 3 of 15
3. (unstack b100 b10)
   deleted: (on b100 b10) (clear b100) (arm-empty)
   added: (holding b100) (clear b10)
   goals met: 3 of 15
4. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 3 of 15
5. (unstack b108 b5)
   deleted: (on b108 b5) (clear b108) (arm-empty)
   added: (holding b108) (clear b5)
   goals met: 4 of 15
6. (putdown b108)
   deleted: (holding b108)
   added: (clear b108) (arm-empty) (on-table b108)
   goals met: 4 of 15
7. (unstack b5 b289)
   deleted: (on b5 b289) (clear b5) (arm-empty)
   added: (holding b5) (clear b289)
   goals met: 3 of 15
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 15
9. (unstack b120 b261)
   deleted: (on b120 b261) (clear b120) (arm-empty)
   added: (holding b120) (clear b261)
   goals met: 5 of 15
10. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 5 of 15
11. (unstack b170 b4)
   deleted: (on b170 b4) (clear b170) (arm-empty)
   added: (holding b170) (clear b4)
   goals met: 5 of 15
12. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 5 of 15
13. (unstack b175 b353)
   deleted: (on b175 b353) (clear b175) (arm-empty)
   added: (holding b175) (clear b353)
   goals met: 5 of 15
14. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 5 of 15
15. (unstack b180 b3)
   deleted: (on b180 b3) (clear b180) (arm-empty)
   added: (holding b180) (clear b3)
   goals met: 5 of 15
16. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 5 of 15
17. (unstack b3 b7)
   deleted: (on b3 b7) (clear b3) (arm-empty)
   added: (holding b3) (clear b7)
   goals met: 6 of 15
18. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 15
19. (unstack b261 b2)
   deleted: (on b261 b2) (clear b261) (arm-empty)
   added: (holding b261) (clear b2)
   goals met: 7 of 15
20. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 7 of 15
21. (unstack b353 b6)
   deleted: (on b353 b6) (clear b353) (arm-empty)
   added: (holding b353) (clear b6)
   goals met: 7 of 15
22. (putdown b353)
   deleted: (holding b353)
   added: (clear b353) (arm-empty) (on-table b353)
   goals met: 7 of 15
23. (unstack b1 b254)
   deleted: (on b1 b254) (clear b1) (arm-empty)
   added: (holding b1) (clear b254)
   goals met: 6 of 15
24. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 8 of 15
25. (unstack b254 b44)
   deleted: (on b254 b44) (clear b254) (arm-empty)
   added: (holding b254) (clear b44)
   goals met: 8 of 15
26. (putdown b254)
   deleted: (holding b254)
   added: (clear b254) (arm-empty) (on-table b254)
   goals met: 8 of 15
27. (unstack b44 b28)
   deleted: (on b44 b28) (clear b44) (arm-empty)
   added: (holding b44) (clear b28)
   goals met: 8 of 15
28. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 8 of 15
29. (unstack b28 b8)
   deleted: (on b28 b8) (clear b28) (arm-empty)
   added: (holding b28) (clear b8)
   goals met: 8 of 15
30. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 8 of 15
31. (unstack b8 b56)
   deleted: (on b8 b56) (clear b8) (arm-empty)
   added: (holding b8) (clear b56)
   goals met: 8 of 15
32. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 9 of 15
33. (unstack b2 b149)
   deleted: (on b2 b149) (clear b2) (arm-empty)
   added: (holding b2) (clear b149)
   goals met: 9 of 15
34. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 10 of 15
35. (unstack b4 b239)
   deleted: (on b4 b239) (clear b4) (arm-empty)
   added: (holding b4) (clear b239)
   goals met: 10 of 15
36. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 11 of 15
37. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 11 of 15
38. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 12 of 15
39. (unstack b9 b247)
   deleted: (on b9 b247) (clear b9) (arm-empty)
   added: (holding b9) (clear b247)
   goals met: 12 of 15
40. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 13 of 15
41. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 12 of 15
42. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 14 of 15
43. (unstack b1 b10)
   deleted: (on b1 b10) (clear b1) (arm-empty)
   added: (holding b1) (clear b10)
   goals met: 12 of 15
44. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 13 of 15
45. (unstack b10 b94)
   deleted: (on b10 b94) (clear b10) (arm-empty)
   added: (holding b10) (clear b94)
   goals met: 13 of 15
46. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 14 of 15
47. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 13 of 15
48. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 15 of 15
